text segment ; Початок сегмента команд
assume CS:text, DS:data ; Сегментний регістр CS вказує на сегменткоманд; сегментний регістр DS - на сегмент даних

begin:mov AX, data ; Адресу сегмента спочатку завантажуємо в АХ,
mov DS, AX ;а потім переносимо з АХ в DS
mov AH, 09h ; Функція DOS 9h означає виведення на екран
mov DX, offset mesg; Адреса повідомлення, що виводиться, повиннобути в DX
int 21h ; Виклик DOS - функція переривання
mov AH, 4Ch ; Функція 4Сh - завершення програми
mov Al, 0 ; Код 0 - код успішного завершення
int 21h ; Виклик DOS
text ends ;Кінець сегмента
data segment ; Початок сегменту даних
mesg db "NACHINAEM ! $"; Текст, що виводиться
data ends ; Кінець сегменту даних
stk segment stack ; Початок сегменту стека
db 256 dup (0) ; Резервуємо 256 байт для стеку
stk ends ; Кінець сегменту стека
end begin ; Кінець тексту програми з точкою входу